---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchOverconstrainedError
source: html/f596027a-3a52-d6a9-2f1f-7b73d1895017.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchOverconstrainedError Property

Sketch is overconstrained.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchOverconstrainedError { get; }
```